/*
Вопрос 1
Какая наивысшая заработная плата у аналитиков данных при работе удаленно? 
*/;



SELECT 
    job_id,
    job_title,
    company_dim.name AS company_name,
    job_schedule_type,
    salary_year
FROM project
LEFT JOIN company_dim ON project.company_id = company_dim.company_id
WHERE job_title_short = 'Data Analyst' AND location LIKE 'Remote' AND salary_year IS NOT NULL
ORDER BY salary_year DESC
LIMIT 10;

/* Выводим столбцы ID, наименование компании, полное наименование вакансии, тип графика работы, ЗП.
По задаче интерисуют только вакансии относящиеся к 'Data Analyst',
с удаленным типом работы и где указанна ЗП.
Сортировка происходит по ЗП по убыванию только 10 верхних значений.

Благодаря этому запросу мы можем выяснить
Какие компании предоставляют наивысшую зарплату для вакансии Data Analyst при работе удаленно

Выводы:
1) Заметен высокий разброс в заработной плате (от 650 тыс. до 189 тыс долларов в год)
2) Разнообразие компаний предоставляющих вакансии, ИТ (Meta), здравохранение (Mantys, Uclahealthcareers), анализ финансов (SmartAsset) и т.д.
3) Разнообразные наименования вакансий отражающие разные роли и специализации между аналитиками данных*/;
